{
  "${ModID}:ClericsRequest": {
    "NAME": "Cleric's Request",
    "DESCRIPTIONS": [
      "You jump in surprise as a voice behind you screams. @\"Friend!@ @I@ @have@ @a@ @deal@ @for@ @you!@ @You@ @can@ @have@ @this@ @powerful@ @staff@ @for@ @free@ @if@ @you@ @take@ @its@ @curse@ @away@ @from@ @here!\"@ After he sees you hesitate at the mention of a curse, he screams again. @\"Or@ @you@ @can@ @buy@ @a@ @+1@ @increase@ @to@ @your@ @constitution!\"@ You don't know who this blue guy with the weird gold jewelry is, but you wish you had spent time to learn the silence spell.",
      "You can sense the power of the staff, and also its malice. You decide that harnessing its power is worth the risk.",
      "You give him the gold, along with a suggestion that he use it to buy an indoor voice. He casts his magic on you in return and the effect is subtle, but your bruises and cuts bother you a little less.",
      "You don't think people that scream a lot for no reason are sane, so you leave without making a deal."
    ],
    "OPTIONS": [
      "[Staff] #gGain !RelicString!. It comes with !CardString!.",
      "[Max HP] #y!E! #yGold: #gGain #g!E2! #gMax #gHP.",
      "[Max HP] Requires: !E! Gold.",
      "[Refuse]",
      "[Leave]"
    ]
  },
  "${ModID}:VoidSpirits": {
    "NAME": "Void Spirits",
    "DESCRIPTIONS": [
      "You happen upon a group of what looks like void spirits dancing around a large well. The inside of the well contains a whirlpool of pitch black water. One of the spirits tosses in a stone and it disappears without making a sound. The spirits then turn to you, and you know enough about void spirits to know they won't let you leave without an offering. However, those who make offerings always receive something in return.",
      "You use a knife to slice open your palm, and let some of your blood flow into the well. You immediately feel weaker than you would expect from minor blood loss. The void spirits bounce up and down and you feel something on one of your fingers. Looking closely, you can just barely make out a ring.",
      "You decide to offer up some of your mana. You concentrate and pour some into the well. Unexpectedly, the connection is two way. You feel something reach out and latch onto your mind and your magic. It offers to take away any unwanted memories, fears, or desires.",
      "Your thoughts seem sharper, more focused. However, you can feel your mana slowly trickling out into the well, although not as fast as you can generate it. It seems some of the connection is permanent.",
      "It was a tough fight but you prevail. You manage to collect some of their essence before they dissipate.",
      "Select a card to remove.",
      "Select cards to remove."
    ],
    "OPTIONS": [
      "[Offer Flesh] #rLose #r!E! #rMax #rHP. #gGain !RelicString!.",
      "[Offer Mana] #rGain !CardString!. #gRemove #g!E2! #gCard.",
      "[Offer Mana] #rGain !CardString!. #gRemove #gup #gto #g!E2! #gCards.",
      "[Offer Mana] Requires a removable card.",
      "[Fight Through] #rDifficult #rFight. #gGain !PotionString!",
      "[Continue]",
      "[Leave]"
    ]
  },
  "${ModID}:ResearchCenter": {
    "NAME": "Research Center",
    "DESCRIPTIONS": [
      "You come across a large building that advertises itself as a research center. Walking inside, there's several wizards bustling about. You're familiar with most of what they do but they do have a few services they can provide. For a price, of course.",
      "Which element do you wish to enhance a card with?",
      "Select a card to enhance.",
      "The elemental master finishes his scroll, and the complexity daunts even you. NL By the time he is finished, almost everyone else has left, so you set off.",
      "The enchantment master shows you how to turn one of your more complex spells into a sigil, and the complexity of the etchings daunts even you. NL By the time she is finished, almost everyone else has left, so you set off.",
      "The potion master hands you a flask with a dull grey substance. NL The brewing process lasted awhile and almost everyone else has left.",
      "None of these options are worth the cost."
    ],
    "OPTIONS": [
      "[Enhance] #y!E! #yGold: #gAdd #gA #gDamage #gType #gTo #gA #gCard.",
      "[Enhance] Requires !E! Gold and an Exile class attack card.",
      "[Cold]",
      "[Phantasmal]",
      "[Eldritch]",
      "[Lightning]",
      "[Sigil] #y!E! #yGold: #gTurn #ga #gCard #ginto #ga #gSigil.",
      "[Sigil] Requires !E! Gold and an Exile class card.",
      "[Potion] #y!E! #yGold: #gGain !PotionString!.",
      "[Potion] Requires !E! Gold.",
      "[Refuse]",
      "[Leave]"
    ]
  }
}